# IMPORTING THE PACKAGE

In [1]:
import matplotlib.pyplot as plt

import pandas as pd

import seaborn as sns

import numpy as np

from sklearn.preprocessing import StandardScaler

from sklearn.preprocessing import LabelEncoder

from sklearn.model_selection import train_test_split

import warnings

warnings.filterwarnings('ignore')

# Load the dataset

In [2]:
df=pd.read_csv("loan_prediction.csv")

In [3]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
df.shape

(614, 13)

In [5]:
df=df.drop(['Loan_ID'],axis=1)

# Handle the Missing values

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             601 non-null    object
 1   Married            611 non-null    object
 2   Dependents         599 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      582 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
 11  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(7)
memory usage: 57.7+ KB

In [7]:
#checking the null values
df.isnull().sum()

Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [8]:
df['LoanAmount']=df['LoanAmount'].fillna(df['LoanAmount'].mean())
df['Loan_Amount_Term']=df['Loan_Amount_Term'].fillna(df['Loan_Amount_Term'].mean())
df['Credit_History']=df['Credit_History'].fillna(df['Credit_History'].mean())

In [9]:
df['Gender']=df['Gender'].fillna(df['Gender'].mode()[0])
df['Married']=df['Married'].fillna(df['Married'].mode()[0])
df['Dependents']=df['Dependents'].fillna(df['Dependents'].mode()[0])
df['Self_Employed']=df['Self_Employed'].fillna(df['Self_Employed'].mode()[0])

In [10]:
df.isnull().sum()

Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

# Handling Categorical Values

In [11]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y

In [12]:
le=LabelEncoder()

In [13]:
df.Gender=le.fit_transform(df.Gender)
df.Married=le.fit_transform(df.Married)
df.Education=le.fit_transform(df.Education)
df.Self_Employed=le.fit_transform(df.Self_Employed)
df.Property_Area=le.fit_transform(df.Property_Area)
df.Loan_Status=le.fit_transform(df.Loan_Status)
df.Dependents=le.fit_transform(df.Dependents)

In [14]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0,0,0,5849,0.0,146.412162,360.0,1.0,2,1
1,1,1,1,0,0,4583,1508.0,128.000000,360.0,1.0,0,0
2,1,1,0,0,1,3000,0.0,66.000000,360.0,1.0,2,1
3,1,1,0,1,0,2583,2358.0,120.000000,360.0,1.0,2,1
4,1,0,0,0,0,6000,0.0,141.000000,360.0,1.0,2,1

# Balancing The Dataset

In [15]:
from imblearn.combine import SMOTETomek

In [16]:
smote = SMOTETomek(0.90)

In [17]:
y = df['Loan_Status']
x = df.drop(columns=['Loan_Status'],axis=1)

In [18]:
x_bal,y_bal = smote.fit_resample(x,y)

In [19]:
print(y.value_counts())
print(y_bal.value_counts())

1    422
0    192
Name: Loan_Status, dtype: int64
1    346
0    303
Name: Loan_Status, dtype: int64

# Scaling The Data

In [20]:
from sklearn.preprocessing import StandardScaler

In [21]:
sc = StandardScaler()
x_bal = sc.fit_transform(x_bal)

In [22]:
x_bal = pd.DataFrame(x_bal)

In [23]:
x_bal.head()

,0,1,2,3,4,5,6,7,8,9,10
0,0.522062,-1.192326,-0.693497,-0.498073,-0.327885,0.109593,-0.540445,0.044724,0.300543,0.575809,1.338069
1,0.522062,0.838697,-0.693497,-0.498073,3.049850,-0.400046,-0.540445,-1.015055,0.300543,0.575809,1.338069
2,0.522062,0.838697,-0.693497,2.007737,-0.327885,-0.474640,0.260449,-0.303371,0.300543,0.575809,1.338069
3,0.522062,-1.192326,-0.693497,-0.498073,-0.327885,0.136604,-0.540445,-0.026605,0.300543,0.575809,1.338069
4,0.522062,0.838697,1.424525,-0.498073,3.049850,0.032315,0.884725,1.633992,0.300543,0.575809,1.338069

# Splitting Data Into Train And Test

In [24]:
x_train, x_test , y_train, y_test = train_test_split(x_bal, y_bal, test_size = 0.33, random_state=42)

In [25]:
print(x_train.shape)
print(y_train.shape)
print(x_test.shape)
print(y_test.shape)

(434, 11)
(434,)
(215, 11)
(215,)

In [26]:
x_train.head()

,0,1,2,3,4,5,6,7,8,9,10
521,-1.915480,-1.192326,-0.693497,-0.498073,-0.327885,-0.497895,-0.540445,-0.770288,0.300543,0.575809,1.338069
178,0.522062,0.838697,-0.693497,-0.498073,-0.327885,-0.909863,0.070925,-0.105681,0.300543,0.575809,-1.254190
260,0.522062,0.838697,-0.693497,-0.498073,-0.327885,-0.507376,0.195576,-0.369268,0.300543,0.575809,0.041939
153,0.522062,0.838697,-0.693497,-0.498073,3.049850,6.066052,1.072891,-0.303371,0.300543,0.575809,0.041939
75,0.522062,-1.192326,-0.693497,-0.498073,-0.327885,-0.513458,0.319209,-0.092502,0.300543,0.575809,0.041939

In [27]:
x_test.head()

,0,1,2,3,4,5,6,7,8,9,10
636,0.522062,-1.192326,-0.693497,-0.498073,-0.327885,0.208158,-0.540445,-0.424772,0.300543,-2.113510,-1.254190
220,-1.915480,-1.192326,-0.693497,-0.498073,-0.327885,-0.325273,-0.540445,-0.105681,0.300543,0.575809,-1.254190
594,-1.915480,0.838697,0.365514,-0.498073,-0.327885,-0.119199,-0.540445,-0.620832,0.300543,0.575809,0.041939
429,0.522062,-1.192326,0.365514,2.007737,-0.327885,-0.457467,-0.098221,-0.646034,0.300543,0.575809,0.041939
72,-1.915480,0.838697,1.424525,-0.498073,-0.327885,-0.690195,0.098436,0.316058,0.300543,0.575809,1.338069

In [28]:
y_train.head()

521    0
178    0
260    1
153    1
75     1
Name: Loan_Status, dtype: int32

In [29]:
y_test.head()

636    0
220    0
594    0
429    1
72     0
Name: Loan_Status, dtype: int32